TheColonelYoung/Arachne/fw/Arachne.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32L4
SH.GPXTI1.0=GPIO_EXTI1
ProjectManager.MainLocation=Src
PA2.GPIO_PuPd=GPIO_PULLUP
PB13.GPIOParameters=GPIO_PuPd
I2C2.IPParameters=Timing
USB_DEVICE.CLASS_NAME_FS=CDC
RCC.USART1Freq_Value=80000000
RCC.SAI1Freq_Value=13714285.714285715
USART2.IPParameters=VirtualMode-Asynchronous
RCC.CortexFreq_Value=80000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32L452CEUx
NVIC.USB_IRQn=true\:0\:0\:false\:false\:true\:false\:true
SPI2.VirtualType=VM_MASTER
PB10.Mode=I2C
PH0-OSC_IN\ (PH0).Signal=GPIO_Output
PH0-OSC_IN\ (PH0).Locked=true
RCC.PLLSAI1RoutputFreq_Value=48000000
PA3.GPIO_PuPd=GPIO_PULLUP
Dma.TIM3_CH1/TRIG.0.MemDataAlignment=DMA_MDATAALIGN_WORD
I2C2.Timing=0x10909CEC
PA0.GPIO_Label=_5V_MON
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_ADC1_Init-ADC1-false-HAL-true,5-MX_SPI2_Init-SPI2-false-HAL-true,6-MX_TIM3_Init-TIM3-false-HAL-true,7-MX_USART2_UART_Init-USART2-false-HAL-true,8-MX_I2C2_Init-I2C2-false-HAL-true,9-MX_USB_DEVICE_Init-USB_DEVICE-false-HAL-false,10-MX_TIM2_Init-TIM2-false-HAL-true
PA9.GPIOParameters=GPIO_Label
PA11.Mode=Device
PA3.GPIOParameters=GPIO_PuPd
PA6.GPIO_Label=I_MON
PB0.GPIO_Label=EXT_2
PB6.GPIO_Label=BUSY_4
PB4\ (NJTRST).GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
RCC.USART2Freq_Value=80000000
PH3-BOOT0\ (BOOT0).Signal=GPIO_Input
TIM3.Pulse-Output\ Compare1\ CH1=65535
PC13.GPIO_Label=FLAG_2
PB11.Signal=I2C2_SDA
PB13.Signal=SPI2_SCK
PB15.Signal=SPI2_MOSI
PA2.GPIOParameters=GPIO_PuPd
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=80000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
PB5.GPIOParameters=GPIO_Label
RCC.I2C3Freq_Value=80000000
RCC.LPTIM1Freq_Value=80000000
Mcu.IP4=RCC
RCC.FCLKCortexFreq_Value=80000000
Mcu.IP5=SPI2
USB_DEVICE.MANUFACTURER_STRING=TheColonelYoung
Mcu.IP2=I2C2
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=NVIC
Mcu.IP0=ADC1
PA14\ (JTCK/SWCLK).Signal=SYS_JTCK-SWCLK
Mcu.IP1=DMA
NVIC.EXTI1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PA12.Signal=USB_DP
PC15-OSC32_OUT\ (PC15).GPIOParameters=GPIO_Label
SPI2.CLKPolarity=SPI_POLARITY_HIGH
Mcu.UserConstants=
RCC.VCOSAI1OutputFreq_Value=96000000
PA10.PinState=GPIO_PIN_SET
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=80000000
RCC.I2C4Freq_Value=80000000
Mcu.IPNb=12
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=80000000
TIM3.Period=65534
PB6.Signal=GPIO_Input
USB_DEVICE.USBD_LPM_ENABLED=0
PB12.PinState=GPIO_PIN_SET
PA8.GPIOParameters=GPIO_Label
Mcu.Pin6=PA1
Mcu.Pin7=PA2
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
Mcu.Pin8=PA3
Mcu.Pin9=PA4
RCC.AHBFreq_Value=80000000
SPI2.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_256
PB13.Locked=true
Mcu.Pin0=PC13
Mcu.Pin1=PC14-OSC32_IN (PC14)
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PC15-OSC32_OUT (PC15)
Mcu.Pin3=PH0-OSC_IN (PH0)
RCC.USART3Freq_Value=80000000
Mcu.Pin4=PH1-OSC_OUT (PH1)
Mcu.Pin5=PA0
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_5
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA0.Locked=true
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIO_PuPd=GPIO_NOPULL
PB2.Signal=GPIO_Input
PA8.Locked=true
PA4.Locked=true
USART2.VirtualMode-Asynchronous=VM_ASYNC
Mcu.IP10=USB
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.IP11=USB_DEVICE
PA4.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PB12.GPIO_Label=CS_6
ProjectManager.FirmwarePackage=STM32Cube FW_L4 V1.16.0
MxDb.Version=DB.6.0.10
PH3-BOOT0\ (BOOT0).GPIOParameters=GPIO_Label
PB0.GPIOParameters=GPIO_Label
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=4000000
Dma.TIM3_CH1/TRIG.0.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
PB14.Mode=Full_Duplex_Master
PB1.GPIO_Label=FLAG_6
Dma.TIM3_CH1/TRIG.0.Priority=DMA_PRIORITY_VERY_HIGH
NVIC.TIM2_IRQn=true\:0\:0\:true\:false\:true\:true\:true
File.Version=6
PA10.GPIO_Label=CS_5
SPI2.CalculateBaudRate=312.5 KBits/s
SH.ADCx_IN11.ConfNb=1
PB7.Signal=GPIO_Output
PH0-OSC_IN\ (PH0).PinState=GPIO_PIN_SET
PA8.Signal=GPIO_Input
PB8.Locked=true
PA14\ (JTCK/SWCLK).Mode=Serial_Wire
RCC.PLLRCLKFreq_Value=80000000
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SH.S_TIM3_CH1.0=TIM3_CH1,Output Compare1 CH1
Dma.RequestsNb=1
PB6.GPIOParameters=GPIO_Label
ProjectManager.HalAssertFull=false
PB0.Locked=true
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_2CYCLES_5
ProjectManager.ProjectName=Arachne
PA0.Signal=ADCx_IN5
PB7.PinState=GPIO_PIN_SET
PB7.GPIO_Label=CS_4
PB4\ (NJTRST).Locked=true
Mcu.Package=UFQFPN48
PB9.Signal=GPIO_Output
PB14.GPIO_PuPd=GPIO_PULLUP
PB1.Signal=GPIO_Input
PA6.Signal=ADCx_IN11
PA7.Locked=true
SPI2.Mode=SPI_MODE_MASTER
PB15.GPIO_PuPd=GPIO_NOPULL
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
RCC.LSCOPinFreq_Value=32000
PA10.Signal=GPIO_Output
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_FS
RCC.DFSDMFreq_Value=80000000
PA5.GPIOParameters=GPIO_Label
PB14.GPIOParameters=GPIO_PuPd
SPI2.CLKPhase=SPI_PHASE_2EDGE
PA10.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PC14-OSC32_IN\ (PC14).Locked=true
PB9.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PB5.GPIO_Label=FLAG_4
RCC.PLLPoutputFreq_Value=22857142.85714286
RCC.APB1TimFreq_Value=80000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.LPUART1Freq_Value=80000000
SPI2.Direction=SPI_DIRECTION_2LINES
PB13.Mode=Full_Duplex_Master
Dma.Request0=TIM3_CH1/TRIG
PA4.GPIO_Label=CS_1
ProjectManager.CustomerFirmwarePackage=
VP_TIM3_VS_ClockSourceINT.Mode=Internal
RCC.HSI48_VALUE=48000000
RCC.PLLSAI1N=24
PA3.Signal=USART2_RX
PH1-OSC_OUT\ (PH1).GPIO_Label=BUSY_1
PB7.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PA6.GPIOParameters=GPIO_Label
RCC.MSI_VALUE=4000000
NVIC.DMA1_Channel6_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.PLLQoutputFreq_Value=80000000
ProjectManager.ProjectFileName=Arachne.ioc
PC15-OSC32_OUT\ (PC15).GPIO_Label=STAT
PB8.GPIOParameters=GPIO_Label
ADC1.Rank-0\#ChannelRegularConversion=1
PA13\ (JTMS/SWDIO).Mode=Serial_Wire
PB9.GPIO_Label=CS_3
Mcu.PinsNb=40
ProjectManager.NoMain=false
USB_DEVICE.VirtualModeFS=Cdc_FS
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,NbrOfConversionFlag,master
PC13.Locked=true
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
PC13.Signal=GPIO_Input
PA9.GPIO_Label=BUSY_5
Dma.TIM3_CH1/TRIG.0.PeriphInc=DMA_PINC_DISABLE
ProjectManager.DefaultFWLocation=true
Dma.TIM3_CH1/TRIG.0.MemInc=DMA_MINC_ENABLE
PC15-OSC32_OUT\ (PC15).Signal=GPIO_Output
PB12.Locked=true
ProjectManager.DeletePrevious=true
USB_DEVICE.IPParameters=VirtualMode,VirtualModeFS,CLASS_NAME_FS,USBD_LPM_ENABLED,PRODUCT_STRING_CDC_FS,MANUFACTURER_STRING
NVIC.USART2_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.FamilyName=M
PH1-OSC_OUT\ (PH1).Signal=GPXTI1
PC14-OSC32_IN\ (PC14).GPIO_Label=BUSY_2
PB9.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
PA3.Mode=Asynchronous
PB8.GPIO_Label=FLAG_3
PB4\ (NJTRST).GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label
PA8.GPIO_Label=FLAG_5
PH1-OSC_OUT\ (PH1).GPIOParameters=GPIO_Label
PA4.PinState=GPIO_PIN_SET
PB11.Mode=I2C
ProjectManager.TargetToolchain=Makefile
USB_DEVICE.PRODUCT_STRING_CDC_FS=Arachne manipulator
PB7.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
PB2.GPIOParameters=GPIO_Label
PA9.Signal=GPIO_Input
PB5.Locked=true
PB9.Locked=true
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,DataSize,CLKPolarity,CLKPhase,BaudRatePrescaler
ProjectManager.RegisterCallBack=
PC15-OSC32_OUT\ (PC15).Locked=true
RCC.USBFreq_Value=48000000
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
RCC.LSE_VALUE=32768
PA1.Signal=GPIO_Input
PB12.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
RCC.PLLSAI1PoutputFreq_Value=13714285.714285715
PB1.Locked=true
TIM3.Channel-Output\ Compare1\ CH1=TIM_CHANNEL_1
PB10.Signal=I2C2_SCL
PB14.Signal=SPI2_MISO
PA5.Signal=ADCx_IN10
PH1-OSC_OUT\ (PH1).Locked=true
board=custom
RCC.VCOOutputFreq_Value=160000000
ProjectManager.LastFirmware=true
PB15.Mode=Full_Duplex_Master
NVIC.TIM3_IRQn=true\:4\:0\:true\:false\:true\:true\:true
PB13.GPIO_PuPd=GPIO_NOPULL
RCC.APB2Freq_Value=80000000
RCC.UART4Freq_Value=80000000
SH.ADCx_IN11.0=ADC1_IN11,IN11-Single-Ended
MxCube.Version=6.1.1
Mcu.Pin37=VP_TIM2_VS_ClockSourceINT
TIM3.OCMode_1=TIM_OCMODE_TOGGLE
Mcu.Pin38=VP_TIM3_VS_ClockSourceINT
Mcu.Pin35=PB9
VP_TIM2_VS_ClockSourceINT.Mode=Internal
RCC.I2C1Freq_Value=80000000
Mcu.Pin36=VP_SYS_VS_Systick
PC13.GPIOParameters=GPIO_Label
Mcu.Pin39=VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS
RCC.RNGFreq_Value=48000000
SH.ADCx_IN10.ConfNb=1
RCC.PLLSAI1QoutputFreq_Value=48000000
Mcu.Pin30=PB5
RCC.ADCFreq_Value=48000000
PA1.GPIO_Label=FLAG_1
PA10.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
Mcu.Pin33=PH3-BOOT0 (BOOT0)
TIM3.IPParameters=Channel-Output Compare1 CH1,OCMode_1,Pulse-Output Compare1 CH1,Period,TIM_MasterOutputTrigger
Mcu.Pin34=PB8
Mcu.Pin31=PB6
Mcu.Pin32=PB7
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label
PB15.GPIOParameters=GPIO_PuPd
ProjectManager.FreePins=false
RCC.IPParameters=ADCFreq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,DFSDMFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,MSI_VALUE,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PLLSAI1N,PLLSAI1PoutputFreq_Value,PLLSAI1QoutputFreq_Value,PLLSAI1RoutputFreq_Value,PWRFreq_Value,RNGFreq_Value,SAI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAI1OutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32L452C(C-E)Ux
RCC.LPTIM2Freq_Value=80000000
Mcu.Pin26=PA12
Mcu.Pin27=PA13 (JTMS/SWDIO)
PA2.Signal=USART2_TX
Mcu.Pin24=PA10
ProjectManager.UnderRoot=false
Mcu.Pin25=PA11
PB2.Locked=true
Mcu.IP8=TIM3
Mcu.IP9=USART2
Mcu.Pin28=PA14 (JTCK/SWCLK)
PH3-BOOT0\ (BOOT0).GPIO_Label=BUSY_3
Mcu.IP6=SYS
Mcu.Pin29=PB4 (NJTRST)
Dma.TIM3_CH1/TRIG.0.Mode=DMA_NORMAL
Mcu.IP7=TIM2
ProjectManager.CoupleFile=false
PA4.Signal=GPIO_Output
RCC.SYSCLKFreq_VALUE=80000000
PB5.Signal=GPIO_Input
Mcu.Pin22=PA8
Mcu.Pin23=PA9
PA1.Locked=true
PA7.GPIO_Label=EXT_1
Mcu.Pin20=PB14
ADC1.master=1
Mcu.Pin21=PB15
PA12.Mode=Device
PA5.GPIO_Label=PWM_MON
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
PC14-OSC32_IN\ (PC14).Signal=GPIO_Input
Dma.TIM3_CH1/TRIG.0.Direction=DMA_MEMORY_TO_PERIPH
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
PB9.PinState=GPIO_PIN_SET
Dma.TIM3_CH1/TRIG.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
PA11.Signal=USB_DM
SH.ADCx_IN10.0=ADC1_IN10,IN10-Single-Ended
PB2.GPIO_Label=BUSY_6
ProjectManager.HeapSize=0x200
PA0.GPIOParameters=GPIO_Label
Mcu.Pin15=PB2
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB10
Mcu.Pin13=PB0
Mcu.Pin14=PB1
Mcu.Pin19=PB13
SH.S_TIM3_CH1.ConfNb=1
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB11
RCC.HSI_VALUE=16000000
Mcu.Pin18=PB12
PC14-OSC32_IN\ (PC14).GPIOParameters=GPIO_Label
SH.ADCx_IN5.0=ADC1_IN5,IN5-Single-Ended
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
ADC1.NbrOfConversionFlag=1
Mcu.Pin11=PA6
PH0-OSC_IN\ (PH0).GPIO_Label=CS_2
Dma.TIM3_CH1/TRIG.0.Instance=DMA1_Channel6
Mcu.Pin12=PA7
RCC.PLLN=40
PH0-OSC_IN\ (PH0).GPIO_Speed=GPIO_SPEED_FREQ_HIGH
Mcu.Pin10=PA5
PH3-BOOT0\ (BOOT0).Locked=true
PB7.Locked=true
PA2.Mode=Asynchronous
PB8.Signal=GPIO_Input
RCC.PWRFreq_Value=80000000
SPI2.DataSize=SPI_DATASIZE_8BIT
SH.ADCx_IN5.ConfNb=1
PB4\ (NJTRST).GPIO_Label=RGB_STAT
TIM3.TIM_MasterOutputTrigger=TIM_TRGO_UPDATE
SH.GPXTI1.ConfNb=1
RCC.I2C2Freq_Value=80000000
RCC.APB1Freq_Value=80000000
PB0.Signal=GPIO_Output
USB_DEVICE.VirtualMode=Cdc
PB4\ (NJTRST).GPIO_PuPd=GPIO_PULLDOWN
PA7.GPIOParameters=GPIO_Label
ProjectManager.DeviceId=STM32L452CEUx
PB12.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=0
PA13\ (JTMS/SWDIO).Signal=SYS_JTMS-SWDIO
PB1.GPIOParameters=GPIO_Label
PA7.Signal=GPIO_Output
PH0-OSC_IN\ (PH0).GPIOParameters=GPIO_Speed,PinState,GPIO_Label
PB4\ (NJTRST).Signal=S_TIM3_CH1
